README-en.org
#+OPTIONS: \n:t
#+OPTIONS: ^:{}
* emacs-sftp
SFTP is the mechanism to use the SCP command to transport files to a remote server 
* Installing
Introduce sftp.el into your configuration and add it to your configuration 
#+BEGIN_SRC emacs-lisp
(require 'sftp)
#+END_SRC
** Linux dependent environment
+ scp
+ sshpass
#+BEGIN_SRC shell
apt-get install sshpass
#+END_SRC
** Windows depends on the environment
+ pscp
[[https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html][Download the PSCP tool here and add it to path]]
* Configuration of the sample
** Connection information Settings
Use .dir-locals.el to set the connection information for the current project
#+BEGIN_SRC emacs-lisp
((nil
  (host ."127.0.0.1")
  (user ."username")
  (password ."password")
  (remote_path ."/www") ;;Remote server engineering path 
  (port ."22")
))
#+END_SRC
Therefore, you need to read the variables and suggest joining before you introduce SFTP
#+BEGIN_SRC emacs-lisp
(setq enable-local-variables :all enable-local-eval t)
  (hack-dir-local-variables)
#+END_SRC
* Usage
+ sftp-get Download current file 
+ sftp-put Upload current file 
+ sftp-get-directory Download the entire folder 
+ sftp-put-directory Upload the entire folder 
